share/doc/qmckl/text/qmckl_memory.txt
                          ___________________

                           MEMORY MANAGEMENT

                                TREX CoE
                          ___________________


Table of Contents
_________________

1. Memory data structure for the context
2. Passing info to allocation routines
3. Allocation/deallocation functions
4. Get the size of a memory block





1 Memory data structure for the context
=======================================

  Every time a new block of memory is allocated, the information
  relative to the allocation is stored in a new
  `qmckl_memory_info_struct'.  A `qmckl_memory_info_struct' contains the
  pointer to the memory block, its size in bytes, and extra
  implementation-specific information such as alignment, pinning, if the
  memory should be allocated on CPU or GPU /etc/.

  ,----
  | typedef struct qmckl_memory_info_struct {
  |   size_t size;
  |   void*  pointer;
  | } qmckl_memory_info_struct;
  | 
  | static const qmckl_memory_info_struct qmckl_memory_info_struct_zero =
  |   {
  |    .size = (size_t) 0,
  |    .pointer = NULL
  |   };
  `----

  The `memory' element of the context is a data structure which contains
  an array of `qmckl_memory_info_struct', the size of the array, and the
  number of allocated blocks.

  ,----
  | typedef struct qmckl_memory_struct {
  |   size_t                    n_allocated;
  |   size_t                    array_size;
  |   qmckl_memory_info_struct* element;
  | } qmckl_memory_struct;
  `----


2 Passing info to allocation routines
=====================================

  Passing information to the allocation routine should be done by
  passing an instance of a `qmckl_memory_info_struct'.


3 Allocation/deallocation functions
===================================
