qmckl_memory.html

<div id="outline-container-org8bdbeec" class="outline-2">
<h2 id="org8bdbeec"><span class="section-number-2">3</span> Allocation/deallocation functions</h2>
<div class="outline-text-2" id="text-3">
<p>
Memory allocation inside the library should be done with
<code>qmckl_malloc</code>. It lets the library choose how the memory will be
allocated, and a pointer is returned to the user.  The context is
passed to let the library store data related to the allocation
inside the context. In this particular implementation of the library,
we store a list of allocated pointers so that all the memory can be
properly freed when the library is de-initialized.
If the allocation failed, the <code>NULL</code> pointer is returned.
</p>

<p>
The allocated memory block is zeroed using <code>memset</code>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">void</span>* <span style="color: #0000ff;">qmckl_malloc</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                   <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_memory_info_struct</span> <span style="color: #a0522d;">info</span>);
</pre>
</div>

<p>
Here's a step-by-step explanation of <code>qmckl_malloc</code>:
</p>

<ol class="org-ol">
<li>The function takes two parameters: a <code>qmckl_context</code> and a
<code>qmckl_memory_info_struct</code> containing the desired size of the memory
block to allocate.</li>

<li>The function checks if the provided <code>qmckl_context</code> is valid, using the
<code>qmckl_context_check</code> function.</li>

<li>The <code>qmckl_context_struct</code> pointer is retrieved from the provided
<code>qmckl_context</code>.</li>

<li>The function then allocates memory:
If the <code>HAVE_HPC</code> macro is defined, the memory allocation is done using
the <code>aligned_alloc</code> function with a 64-byte alignment, rounding up the
requested size to the nearest multiple of 64 bytes. If the <code>HAVE_HPC</code>
macro is not defined, the memory allocation is done using the standard
<code>malloc</code> function.</li>
</ol>

<p>
5  If the allocation fails, the function returns <code>NULL</code>.
</p>

<ol class="org-ol">
<li>The allocated memory block is zeroed using <code>memset</code>.</li>

<li>The function acquires a lock on the <code>qmckl_context</code> using <code>qmckl_lock</code>.</li>

<li>Inside the locked section, the function checks if the
<code>qmckl_memory_struct</code> is full. If it is, it reallocates a larger array
by doubling its size and updating the <code>array_size</code> member of the
<code>qmckl_memory_struct</code>.</li>

<li>The function finds the first available <code>qmckl_memory_info_struct</code> slot
in the element array of the <code>qmckl_memory_struct</code>.</li>
</ol>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">void</span>* <span style="color: #0000ff;">qmckl_malloc</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_memory_info_struct</span> <span style="color: #a0522d;">info</span>) {

  assert (qmckl_context_check(context) != QMCKL_NULL_CONTEXT);

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;

  /* <span style="color: #b22222;">Allocate memory and zero it</span> */
<span style="color: #483d8b;">#ifdef</span> HAVE_HPC
  assert( ((info.size+64) &gt;&gt; 6) &lt;&lt; 6 &gt;= info.size );
  <span style="color: #228b22;">void</span> * <span style="color: #a0522d;">pointer</span> = aligned_alloc(64, ((info.size+64) &gt;&gt; 6) &lt;&lt; 6 );
<span style="color: #483d8b;">#else</span>
  <span style="color: #228b22;">void</span> * <span style="color: #a0522d;">pointer</span> = malloc(info.size);
<span style="color: #483d8b;">#endif</span>
  <span style="color: #a020f0;">if</span> (pointer == <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
  }
  memset(pointer, 0, info.size);

  qmckl_lock(context);
  {
    /* <span style="color: #b22222;">If qmckl_memory_struct is full, reallocate a larger one</span> */
    <span style="color: #a020f0;">if</span> (ctx-&gt;memory.n_allocated == ctx-&gt;memory.array_size) {
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">old_size</span> = ctx-&gt;memory.array_size;
      <span style="color: #228b22;">qmckl_memory_info_struct</span> * <span style="color: #a0522d;">new_array</span> = realloc(ctx-&gt;memory.element,
                                                          2L * old_size *
                                                          <span style="color: #a020f0;">sizeof</span>(qmckl_memory_info_struct));
      <span style="color: #a020f0;">if</span> (new_array == <span style="color: #008b8b;">NULL</span>) {
        qmckl_unlock(context);
        free(pointer);
        <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
      }

      memset( &amp;(new_array[old_size]), 0, old_size * <span style="color: #a020f0;">sizeof</span>(qmckl_memory_info_struct) );
      ctx-&gt;memory.element = new_array;
      ctx-&gt;memory.array_size = 2L * old_size;
    }

    /* <span style="color: #b22222;">Find first NULL entry</span> */
    <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">pos</span> = (<span style="color: #228b22;">size_t</span>) 0;
    <span style="color: #a020f0;">while</span> ( pos &lt; ctx-&gt;memory.array_size &amp;&amp; ctx-&gt;memory.element[pos].size &gt; (<span style="color: #228b22;">size_t</span>) 0) {
      pos += (<span style="color: #228b22;">size_t</span>) 1;
    }
    assert (ctx-&gt;memory.element[pos].size == (<span style="color: #228b22;">size_t</span>) 0);

    /* <span style="color: #b22222;">Copy info at the new location</span> */
    memcpy(&amp;(ctx-&gt;memory.element[pos]), &amp;info, <span style="color: #a020f0;">sizeof</span>(qmckl_memory_info_struct));
    ctx-&gt;memory.element[pos].pointer = pointer;
    ctx-&gt;memory.n_allocated += (<span style="color: #228b22;">size_t</span>) 1;
//<span style="color: #b22222;">printf("MALLOC: %5ld  %p\n", ctx-&gt;memory.n_allocated, ctx-&gt;memory.element[pos].pointer);</span>
  }
  qmckl_unlock(context);

  <span style="color: #a020f0;">return</span> pointer;
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Create a context</span> */
<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span> = qmckl_context_create();

<span style="color: #228b22;">qmckl_memory_info_struct</span> <span style="color: #a0522d;">info</span> = qmckl_memory_info_struct_zero;
info.size = (<span style="color: #228b22;">size_t</span>) 3*<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>);

/* <span style="color: #b22222;">Allocate an array of ints</span> */
<span style="color: #228b22;">int</span> *<span style="color: #a0522d;">a</span> = (<span style="color: #228b22;">int</span>*) <span style="color: #0000ff;">qmckl_malloc</span>(context, info);

/* <span style="color: #b22222;">Check that array of ints is OK</span> */
<span style="color: #0000ff;">assert</span>(a != <span style="color: #008b8b;">NULL</span>);
<span style="color: #228b22;">a</span>[0] = 1;  <span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">a</span>[0] == 1);
<span style="color: #228b22;">a</span>[1] = 2;  <span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">a</span>[1] == 2);
<span style="color: #228b22;">a</span>[2] = 3;  <span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">a</span>[2] == 3);

/* <span style="color: #b22222;">Allocate another array of ints</span> */
<span style="color: #228b22;">int</span> *<span style="color: #a0522d;">b</span> = (<span style="color: #228b22;">int</span>*) <span style="color: #0000ff;">qmckl_malloc</span>(context, info);

/* <span style="color: #b22222;">Check that array of ints is OK</span> */
<span style="color: #0000ff;">assert</span>(b != <span style="color: #008b8b;">NULL</span>);
<span style="color: #228b22;">b</span>[0] = 1;  <span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">b</span>[0] == 1);
<span style="color: #228b22;">b</span>[1] = 2;  <span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">b</span>[1] == 2);
<span style="color: #228b22;">b</span>[2] = 3;  <span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">b</span>[2] == 3);
</pre>
</div>

<p>
When freeing the memory with <code>qmckl_free</code>, the context is passed, in
case some important information has been stored related to memory
allocation and needs to be updated.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_free</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                           <span style="color: #228b22;">void</span> * <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">ptr</span>);
</pre>
</div>

<p>
Here's a step-by-step explanation of the <code>qmckl_free</code> function:
</p>

<ol class="org-ol">
<li>The function takes two parameters: a <code>qmckl_context</code> and a pointer to
the memory block (<code>ptr</code>) that needs to be deallocated.</li>

<li>The function checks if the provided <code>qmckl_context</code> is valid, using the
<code>qmckl_context_check</code> function. If it is not valid, it returns an error
code <code>QMCKL_INVALID_CONTEXT</code> using the <code>qmckl_failwith</code> function.</li>

<li>The function checks if the provided pointer is <code>NULL</code>. If it is, it
returns an error code <code>QMCKL_INVALID_ARG_2</code> using the <code>qmckl_failwith</code>
function.</li>

<li>The <code>qmckl_context_struct</code> pointer is retrieved from the provided
<code>qmckl_context</code>.</li>

<li>The function acquires a lock on the <code>qmckl_context</code> using <code>qmckl_lock</code>.</li>

<li>Inside the locked section, the function searches for the pointer in
the element array of the <code>qmckl_memory_struct</code>.</li>

<li>If the pointer is not found in the array, it releases the lock and
returns an error code <code>QMCKL_INVALID_ARG_2</code> using the <code>qmckl_failwith</code>
function.</li>

<li>If the pointer is found, the memory block is deallocated using the
standard <code>free</code> function.</li>

<li>The <code>qmckl_memory_info_struct</code> at the found position is zeroed
using <code>memset</code>. This marks the slot as available for future
allocations.</li>
</ol>
<ol class="org-ol">
<li>The <code>n_allocated</code> member of the <code>qmckl_memory_struct</code> is decremented
by one, as the memory block has been deallocated.</li>

<li>The function releases the lock on the <code>qmckl_context</code> using <code>qmckl_unlock</code>.</li>

<li>Finally, the function returns <code>QMCKL_SUCCESS</code> to indicate
successful deallocation of the memory block.</li>
</ol>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_free</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #228b22;">void</span> * <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">ptr</span>) {

  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
      <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                            QMCKL_INVALID_CONTEXT,
                            <span style="color: #8b2252;">"qmckl_free"</span>,
                            <span style="color: #008b8b;">NULL</span>);
  }

  <span style="color: #a020f0;">if</span> (ptr == <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                          QMCKL_INVALID_ARG_2,
                          <span style="color: #8b2252;">"qmckl_free"</span>,
                          <span style="color: #8b2252;">"NULL pointer"</span>);
  }

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;

  qmckl_lock(context);
  {
    /* <span style="color: #b22222;">Find pointer in array of saved pointers</span> */
    <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">pos</span> = (<span style="color: #228b22;">size_t</span>) 0;
    <span style="color: #a020f0;">while</span> ( pos &lt; ctx-&gt;memory.array_size &amp;&amp; ctx-&gt;memory.element[pos].pointer != ptr) {
      pos += (<span style="color: #228b22;">size_t</span>) 1;
    }

    <span style="color: #a020f0;">if</span> (pos &gt;= ctx-&gt;memory.array_size) {
      /* <span style="color: #b22222;">Not found</span> */
      qmckl_unlock(context);
      <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                            QMCKL_INVALID_ARG_2,
                            <span style="color: #8b2252;">"qmckl_free"</span>,
                            <span style="color: #8b2252;">"Pointer not found in context"</span>);
    }

    /* <span style="color: #b22222;">Found</span> */

    free(ptr);

    ctx-&gt;memory.n_allocated -= (<span style="color: #228b22;">size_t</span>) 1;
//<span style="color: #b22222;">printf("FREE  : %5ld  %p\n", ctx-&gt;memory.n_allocated, ctx-&gt;memory.element[pos].pointer);</span>
    ctx-&gt;memory.element[pos] = qmckl_memory_info_struct_zero;
  }
  qmckl_unlock(context);

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>
</div>
</div>
