qmckl_memory.html
<div id="outline-container-orgb4e4ab5" class="outline-2">
<h2 id="orgb4e4ab5"><span class="section-number-2">4</span> Get the size of a memory block</h2>
<div class="outline-text-2" id="text-4">
<p>
All the blocks allocated with <code>qmckl_malloc</code> keep track of how many
bytes were allocated. Using <code>qmckl_malloc_size</code> allows to get this information.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_get_malloc_info</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">void</span>* <span style="color: #a0522d;">pointer</span>, 
                      <span style="color: #228b22;">qmckl_memory_info_struct</span>* <span style="color: #a0522d;">info</span>);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_get_malloc_info</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">void</span>* <span style="color: #a0522d;">ptr</span>, 
                      <span style="color: #228b22;">qmckl_memory_info_struct</span>* <span style="color: #a0522d;">info</span>) 
{

  assert (qmckl_context_check(context) != QMCKL_NULL_CONTEXT);

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;

  <span style="color: #a020f0;">if</span> (ptr == <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                          QMCKL_INVALID_ARG_2,
                          <span style="color: #8b2252;">"qmckl_get_malloc_info"</span>,
                          <span style="color: #8b2252;">"Null pointer"</span>);
  }

  <span style="color: #a020f0;">if</span> (info == <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                          QMCKL_INVALID_ARG_3,
                          <span style="color: #8b2252;">"qmckl_get_malloc_info"</span>,
                          <span style="color: #8b2252;">"Null pointer"</span>);
  }

  qmckl_lock(context);
  {
    /* <span style="color: #b22222;">Find the pointer entry</span> */
    <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">pos</span> = (<span style="color: #228b22;">size_t</span>) 0;
    <span style="color: #a020f0;">while</span> ( pos &lt; ctx-&gt;memory.array_size &amp;&amp; ctx-&gt;memory.element[pos].pointer != ptr) {
      pos += (<span style="color: #228b22;">size_t</span>) 1;
    }

    <span style="color: #a020f0;">if</span> (pos &gt;= ctx-&gt;memory.array_size) {
      /* <span style="color: #b22222;">Not found</span> */
      qmckl_unlock(context);
      <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                            QMCKL_INVALID_ARG_2,
                            <span style="color: #8b2252;">"qmckl_get_malloc_info"</span>,
                            <span style="color: #8b2252;">"Pointer not found in context"</span>);
    }

    /* <span style="color: #b22222;">Copy info</span> */
    memcpy(info, &amp;(ctx-&gt;memory.element[pos]), <span style="color: #a020f0;">sizeof</span>(qmckl_memory_info_struct));
  }
  qmckl_unlock(context);

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Create a context</span> */
context = qmckl_context_create();

info = qmckl_memory_info_struct_zero;
info.size = (<span style="color: #228b22;">size_t</span>) 3*<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>);

/* <span style="color: #b22222;">Allocate an array of ints</span> */
a = (<span style="color: #228b22;">int</span>*) <span style="color: #0000ff;">qmckl_malloc</span>(context, info);

/* <span style="color: #b22222;">Check that the size of a is 3*sizeof(int)</span> */
info = qmckl_memory_info_struct_zero;
rc = qmckl_get_malloc_info(context, <span style="color: #008b8b;">NULL</span>, &amp;info);
<span style="color: #0000ff;">assert</span> (rc == QMCKL_INVALID_ARG_2);
rc = qmckl_get_malloc_info(context, &amp;rc, &amp;info);
<span style="color: #0000ff;">assert</span> (rc == QMCKL_INVALID_ARG_2);
rc = qmckl_get_malloc_info(context, a, &amp;info);
<span style="color: #0000ff;">assert</span> (rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span> (info.size == 3*<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>));
rc = qmckl_context_destroy(context);
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TREX CoE</p>
<p class="date">Created: 2023-07-13 Thu 07:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
