share/doc/qmckl/text/qmckl_memory.txt


4 Get the size of a memory block
================================

  All the blocks allocated with `qmckl_malloc' keep track of how many
  bytes were allocated. Using `qmckl_malloc_size' allows to get this
  information.

  ,----
  | qmckl_exit_code
  | qmckl_get_malloc_info(qmckl_context context,
  |                       const void* pointer, 
  |                       qmckl_memory_info_struct* info);
  `----

  ,----
  | qmckl_exit_code
  | qmckl_get_malloc_info(qmckl_context context,
  |                       const void* ptr, 
  |                       qmckl_memory_info_struct* info) 
  | {
  | 
  |   assert (qmckl_context_check(context) != QMCKL_NULL_CONTEXT);
  | 
  |   qmckl_context_struct* const ctx = (qmckl_context_struct*) context;
  | 
  |   if (ptr == NULL) {
  |     return qmckl_failwith(context,
  |                           QMCKL_INVALID_ARG_2,
  |                           "qmckl_get_malloc_info",
  |                           "Null pointer");
  |   }
  | 
  |   if (info == NULL) {
  |     return qmckl_failwith(context,
  |                           QMCKL_INVALID_ARG_3,
  |                           "qmckl_get_malloc_info",
  |                           "Null pointer");
  |   }
  | 
  |   qmckl_lock(context);
  |   {
  |     /* Find the pointer entry */
  |     size_t pos = (size_t) 0;
  |     while ( pos < ctx->memory.array_size && ctx->memory.element[pos].pointer != ptr) {
  |       pos += (size_t) 1;
  |     }
  | 
  |     if (pos >= ctx->memory.array_size) {
  |       /* Not found */
  |       qmckl_unlock(context);
  |       return qmckl_failwith(context,
  |                             QMCKL_INVALID_ARG_2,
  |                             "qmckl_get_malloc_info",
  |                             "Pointer not found in context");
  |     }
  | 
  |     /* Copy info */
  |     memcpy(info, &(ctx->memory.element[pos]), sizeof(qmckl_memory_info_struct));
  |   }
  |   qmckl_unlock(context);
  | 
  |   return QMCKL_SUCCESS;
  | }
  `----


  ,----
  | /* Create a context */
  | context = qmckl_context_create();
  | 
  | info = qmckl_memory_info_struct_zero;
  | info.size = (size_t) 3*sizeof(int);
  | 
  | /* Allocate an array of ints */
  | a = (int*) qmckl_malloc(context, info);
  | 
  | /* Check that the size of a is 3*sizeof(int) */
  | info = qmckl_memory_info_struct_zero;
  | rc = qmckl_get_malloc_info(context, NULL, &info);
  | assert (rc == QMCKL_INVALID_ARG_2);
  | rc = qmckl_get_malloc_info(context, &rc, &info);
  | assert (rc == QMCKL_INVALID_ARG_2);
  | rc = qmckl_get_malloc_info(context, a, &info);
  | assert (rc == QMCKL_SUCCESS);
  | assert (info.size == 3*sizeof(int));
  | rc = qmckl_context_destroy(context);
  `----
